brew "git"
brew "diff-so-fancy"
brew "yadm"
brew "neovim"
brew "nvm"
brew "tmux"
brew "go"
brew "zoxide"
brew "fzf"
brew "fd"
brew "ripgrep"

cask "wezterm"
cask "docker"
cask "postman"
cask "dbeaver-community"

cask "figma"

cask "dotnet-sdk"

cask "logseq"
cask "spotify"

