tap "jandedobbeleer/oh-my-posh"
tap "mongodb/brew"
brew "anomalyco/tap/opencode"
brew "bash"
brew "bitwarden-cli"
brew "btop"
brew "cmake"
brew "diff-so-fancy"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jq"
brew "lazygit"
brew "lsd"
brew "luarocks"
brew "mise"
brew "mole"
brew "mongodb-atlas-cli"
brew "mongodb/brew/mongodb-community"
brew "neovim"
brew "opencode"
brew "openjdk@17"
brew "python@3.13"
brew "resvg"
brew "ripgrep"
brew "sdl2"
brew "sox"
brew "stow"
brew "tmux"
brew "tokei"
brew "yadm"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
cask "1password"
cask "1password-cli"
cask "arc"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "docker-desktop"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "logseq"
cask "postman"
cask "raycast"
cask "spotify"
cask "wezterm"
