tap "anomalyco/tap"
tap "auth0/auth0-cli"
tap "jandedobbeleer/oh-my-posh"
tap "jstkdng/programs"
tap "leoafarias/fvm"
tap "mongodb/brew"
tap "supabase/tap"
brew "bash"
brew "bitwarden-cli"
brew "btop"
brew "chafa"
brew "cmake"
brew "cocoapods"
brew "diff-so-fancy"
brew "fd"
brew "sdl2"
brew "ffmpeg"
brew "firebase-cli"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "lsd"
brew "luarocks"
brew "mise"
brew "mole"
brew "mongodb-atlas-cli"
brew "tree-sitter"
brew "neovim"
brew "openjdk@17"
brew "osv-scanner"
brew "python@3.13"
brew "resvg"
brew "ripgrep"
brew "sox"
brew "stow"
brew "stripe-cli"
brew "supabase"
brew "tmux"
brew "tokei"
brew "uv"
brew "viu"
brew "wget"
brew "yadm"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "anomalyco/tap/opencode"
brew "auth0/auth0-cli/auth0"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jstkdng/programs/ueberzugpp"
brew "mongodb/brew/mongodb-community"
cask "1password"
cask "1password-cli"
cask "arc"
cask "bitwarden"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "db-browser-for-sqlite"
cask "docker-desktop"
cask "figma"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "logseq"
cask "postman"
cask "raycast"
cask "todoist-app"
cask "zed"
vscode "1yib.svelte-bundle"
vscode "anthropic.claude-code"
vscode "ardenivanov.svelte-intellisense"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fronterior.biome-monorepo"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-playwright.playwright"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "svelte.svelte-vscode"
vscode "vscodevim.vim"
go "cmd/go"
go "cmd/gofmt"
go "github.com/google/yamlfmt/cmd/yamlfmt"
uv "shandy-sqlfmt[jinjafmt]"
