brew "bash"
brew "btop"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "lsd"
brew "luarocks"
brew "mise"
brew "neovim"
brew "opencode"
brew "ripgrep"
brew "tmux"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"

cask "wezterm"
cask "font-hack-nerd-font"
cask "raycast"
cask "1password"
cask "1password-cli"
cask "logseq"
cask "arc"
cask "spotify"
